<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"0614060a9ba40395529304ba95dc7515e35dd7b92351806eaabdffa177ca61ec","plan_job_ref":"Job Terraform Plan #14 at https://github.com/Ileriayo/terraform-github-actions-aws/actions/runs/10346507794","plan_out_hash":"b5e50ee3fd79a93606c4296e33de3178dbcfdf51fc61208b6d33715d89498900","plan_hash":"1235ac5f952204642d2d0e6a5225daad2483dd2c52e26bde570def8e5455116c","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __./roots/ecr__
With backend config: `bucket=ileri-tf-state
key=tfstate
region=eu-central-1
`
With variables: `repository_name = "ghactions-test-f08edcc54789e4211b7a98daf4b95d2a97ba9419"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.ecr.aws_ecr_repository.repository will be created
+   resource "aws_ecr_repository" "repository" {
+       arn                  = (known after apply)
+       force_delete         = true
+       id                   = (known after apply)
+       image_tag_mutability = "IMMUTABLE"
+       name                 = "ghactions-test-f08edcc54789e4211b7a98daf4b95d2a97ba9419"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags                 = {
+           "Environment" = "Dev"
+           "Name"        = "DevOps"
        }
+       tags_all             = {
+           "Environment" = "Dev"
+           "Name"        = "DevOps"
        }

+       encryption_configuration {
+           encryption_type = "KMS"
+           kms_key         = (known after apply)
        }

+       image_scanning_configuration {
+           scan_on_push = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #14](https://github.com/Ileriayo/terraform-github-actions-aws/actions/runs/10346507794)